/*!SECTION
Сирний Сирник щойно придбав новий монітор! Він ним задоволений, але щойно виявив, що його старі шпалери для робочого столу більше не підходять. Він хоче знайти нові шпалери, але не знає, якого розміру шпалери слід шукати, і, на жаль, він щойно викинув коробку з новим монітором. На щастя, він пам'ятає ширину та співвідношення сторін монітора, який йому продав Боб Мортимер. Чи можете ви допомогти Сирнику?

Задача
За заданою цілочисельною шириною та співвідношенням сторін у вигляді рядка ШИРИНА:ВИСОТА виведіть розміри екрану у вигляді рядка ШИРИНАxВИСОТА.

Зауваження: Обчислену висоту слід виводити цілим числом. Якщо висота є дробовим числом, відкиньте його.
*/

function findScreenHeight(width, ratio) {
	const [ratioWidth, ratioHeight] = ratio.split(":").map(Number);
	const height = (width * ratioHeight) / ratioWidth;
	return `${width}x${height}`
}

console.log(findScreenHeight(1024,"4:3"));