/*!SECTION

Давайте побудуємо систему пошуку, яка допоможе знайти роботу для розробників на основі низки факторів.

Один з найпростіших, але найважливіших факторів - це оплата праці. Як розробники, ми знаємо, скільки грошей нам потрібно для підтримки нашого способу життя, тому зазвичай маємо приблизне уявлення про мінімальну зарплату, яка нас би задовольнила.

Давайте спробуємо це зробити. Ми створимо функцію match (job_matching в Python), яка отримує кандидата і вакансію, і повертає булеве значення, що вказує на те, чи підходить вакансія кандидату.

Кандидат матиме мінімальну зарплату, тому функція буде виглядати так:

let candidate = {
  minSalary: 120000
}

A job will have a maximum salary, so it will look like this:

let job = {
  maxSalary: 140000
}

Якщо мінімальна або максимальна заробітна плата кандидата не співпадає з максимальною заробітною платою вакансії, то буде видана помилка.

Для коректного збігу мінімальна зарплата кандидата повинна бути меншою або дорівнювати максимальній зарплаті вакансії. Однак, давайте також врахуємо 10% вільного простору (віднімається від мінімальної зарплати кандидата) на випадок, якщо кандидат є рок-зіркою, яка любить програмувати на Codewars у вільний час. Компанія, яка пропонує роботу, можливо, зможе домовитися про це.

*/


let candidate = {
  minSalary: 120000
}

let job = {
  maxSalary: 140000
}

function match(candidate, job) {
	if (!candidate.minSalary || !job.maxSalary) throw new Error('Invalid salary');

	return job.maxSalary >= (candidate.minSalary * 0.9);
}

console.log(match(candidate, job));
