/*!SECTION
Ви отримуєте назву міста у вигляді рядка, і вам потрібно повернути рядок, який показує, скільки разів кожна літера зустрічається у рядку, використовуючи зірочки (*).

Наприклад:

«Чикаго» --> »c:**,h:*,i:*,a:*,g:*,o:*»
Як бачите, літера c показана лише один раз, але з 2 зірочками.

Рядок, що повертається, повинен містити лише літери (без тире, пропусків, апострофів тощо). У вихідних даних не повинно бути пропусків, а різні літери відокремлюються комою (,), як показано у прикладі вище.

Зверніть увагу, що рядок, який повертається, повинен містити літери у порядку їх першої появи у вихідному рядку.

Більше прикладів:

«Бангкок» --> »b:*,a:*,n:*,g:*,k:**,o:*»
«Las Vegas» --> »l:*,a:**,s:**,v:*,e:*,g:*»

*/

function getStrings(city){
  const obj = [...city.toLowerCase()]
    .filter(letter => /[a-z]/.test(letter))
    .reduce((acc, letter) => {
      acc[letter] = (acc[letter] || '') + '*';
      return acc;
    }, {})

  return Object.entries(obj)
    .map(([ key, value ]) => `${key}:${value}`)
		.join()
}

console.log(getStrings('Chicago'))

