/*!SECTION
Необхідно завершити функцію/метод для двох найстаріших вікових груп. Вона повинна приймати масив чисел як аргумент і повертати два найбільших числа в масиві. Значення, що повертається, має бути масивом у форматі [другий найстарший вік, найстарший вік].

Порядок чисел може бути довільним. Масив завжди буде містити принаймні 2 елементи. Якщо є два або більше найстарших віку, то поверніть обидва у форматі масиву.

For example (Input --> Output):

[1, 2, 10, 8] --> [8, 10]
[1, 5, 87, 45, 8, 8] --> [45, 87]
[1, 3, 10, 0]) --> [3, 10]

*/

// v1

function twoOldestAges(ages) {
	return ages.sort((a, b) => a - b).splice(-2)
}

console.log(twoOldestAges([1, 5, 87, 45, 8, 8]))
console.log(twoOldestAges([1, 2, 10, 8]))
console.log(twoOldestAges([1, 3, 10, 0]))