/*!SECTION

Крокетний клуб Західного передмістя має дві категорії членства: Senior та Open. Вони хотіли б, щоб ви допомогли їм заповнити анкету, яка повідомить майбутнім членам клубу, до якої категорії вони будуть віднесені.

Для того, щоб стати членом клубу, член повинен бути не молодше 55 років і мати гандикап більше 7. У цьому клубі гандикапи варіюються від -2 до +26; чим кращий гравець, тим нижчий гандикап.

Вхідні дані
Вхідні дані складаються зі списку пар. Кожна пара містить інформацію про одного потенційного учасника. Інформація складається з цілого числа для віку людини та цілого числа для гандикапу людини.

Вихідні дані
Вихідні дані складаються зі списку рядкових значень (на мовах Haskell та C: Open або Senior), які вказують на те, до якої категорії належить відповідний учасник - відкритої чи закритої.

input =  [[18, 20], [45, 2], [61, 12], [37, 6], [21, 21], [78, 9]]
output = ["Open", "Open", "Senior", "Open", "Open", "Senior"]

*/

// v1

function openOrSenior(data) {
	return data.map(([age, handicap]) =>
		age >= 55 && handicap > 7 ? 'Senior' : 'Open'
	)
}

console.log(
	openOrSenior([
		[18, 20],
		[45, 2],
		[61, 12],
		[37, 6],
		[21, 21],
		[78, 9],
	])
);

// v2

function openOrSenior(data) {
	return data.reduce((result, [age, handicap]) => {
			result.push(age >= 55 && handicap > 7 ? 'Senior' : 'Open');
			return result;
	}, []);
}

console.log(openOrSenior([
	[18, 20],
	[45, 2],
	[61, 12],
	[37, 6],
	[21, 21],
	[78, 9],
]));
