/*!SECTION
Задача
За заданим масивом/списком [] цілих чисел знайти максимальну різницю між послідовними елементами у відсортованому вигляді.

Примітки
Розмір масиву/списку не менше 3 .

Числа масиву/списку будуть мішати додатні та від'ємні числа, а також нулі_.

Можливі повтори чисел у масиві/списку.

Максимальний розрив обчислюється незалежно від знаку.

Input >> Output Examples
maxGap ({13,10,5,2,9}) ==> return (4)

Пояснення:
Максимальний пропуск після сортування масиву дорівнює 4 , Різниця між 9 - 5 = 4 .

maxGap ({-3,-27,-4,-2}) ==> return (23)

Пояснення:
Максимальний пропуск після сортування масиву дорівнює 23 , різниця між |-4- (-27) | = 23 .

Зауваження : Незалежно від знаку від'ємності.

maxGap ({-7,-42,-809,-14,-12}) ==> return (767)

Пояснення:
Максимальний пропуск після сортування масиву дорівнює 767 , Різниця між | -809- (-42) | = 767 .

Зауваження: Незалежно від знаку від'ємності.

maxGap ({-54,37,0,64,640,0,-15}) //return (576)

Пояснення:
Максимальний пропуск після сортування масиву дорівнює 576 , різниця між | 64 - 640 | = 576 .

Зауваження : Незалежно від знаку від'ємності.

*/

// v1
function maxGap (numbers){
  //your code here
}