/*!SECTION

Ваша мета в цій kata - реалізувати функцію відмінності, яка віднімає один список з іншого і повертає результат.

Він повинен видалити всі значення зі списку a, які присутні в списку b, зберігаючи їх порядок.

arrayDiff ([1,2], [1]) = = [2]
Якщо значення присутнє в b, всі його випадки повинні бути видалені з іншого:

arrayDiff ([1,2,2,2,3], [2]) = = [1,3

*/

function arrayDiff(a, b) {
  return a.filter(el => !b.includes(el))
}

console.log(arrayDiff([1, 2], [1]));
console.log(arrayDiff([1, 2, 2, 3], [2]));