/*!SECTION

Ця функція повинна перевірити, якщо фактор є фактором бази.

Повертає true, якщо це фактор або false, якщо це не так.

Про фактори
Множники - це числа, які можна помножити разом, щоб отримати інше число.

2 і 3 є множниками 6, тому що: 2 * 3 = 6

Ви можете знайти коефіцієнт діленням чисел. Якщо залишок дорівнює 0, то число є множником.
Ви можете використовувати оператор мода (%) на більшості мов, щоб перевірити залишок
Наприклад, 2 не є фактором 7, тому що: 7% 2 = 1

Примітка: основою є невід'ємне число, фактором є додатне число.

*/

// v1

function checkForFactor(base, factor) {
	if (base % factor === 0) {
		return true
	}
	return false
}

console.log(checkForFactor(2, 7))
console.log(checkForFactor(10, 2))

// v2

function checkForFactor(base, factor) {
	return base % factor === 0
}

